tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "neovim/neovim"
tap "dart-lang/dart"
tap "d12frosted/emacs-plus"


# --- terminal
brew "nvm"
brew "node"
brew "git"
# brew "universal-ctags"

brew "vim"
brew "neovim"
brew "yarn"

brew "autojump"
brew "tree"
brew "ripgrep"
brew "fzf"
# brew "mackup"  # for backup

# ------ iOS
# brew "carthage"  # iOS
brew "cocoapods" # iOS

# ------ lang
brew "ruby"
brew "dart"
# brew "elixir"
# brew "erlang"

# ------ DB
# brew "mysql"
# brew "postgresql"
# brew "mongodb-community"
# brew "sqlite"

# --- GUI App

# ------ NSFW
cask "steam"
cask "openemu" # GAME
cask "iina" # FILM
cask "mipony"

# ------ commen
brew "emacs-plus"
brew "macvim"
cask "alfred"
cask "karabiner-elements"
cask "sogouinput"
cask "notion"
cask "spectacle"
cask "appcleaner"
cask "clean-me"
cask "hiddenbar" # replace "vanilla"
cask "itsycal"
cask "overkill"
cask "kensington-trackball-works"
cask "spotify"
cask "1password"
brew "p7zip"
cask "fliqlo"

# ------ IDE
cask "android-studio"
cask "visual-studio-code"

# ------ web browser
cask "google-chrome"
# cask "firefox-nightly"
cask "firefox-developer-edition"

# ------ Database tools
cask "mongodb-compass"
# cask "sequel-pro"

# ------ dev tools
cask "postman"
cask "dash"
cask "fork"

# ------ IM
cask "slack"
cask "telegram"

# ------ terminal emulator
# cask "hyper"
cask "iterm2"

# ------ fonts
cask "font-source-code-pro"
cask "font-jetbrains-mono"

# ------ can't install by brew
# Monosnap
# LINE

